from sys import exec_prefix

from bnlp.corpus import stopwords, punctuations
from bnlp.corpus.util import remove_stopwords
from mtranslate import translate
import nltk
from nltk.sentiment import SentimentIntensityAnalyzer

nltk.download('stopwords')
nltk.download('vader_lexicon')

raw_text = '''কুমিল্লার নাঙ্গলকোট উপজেলার হাসানপুর রেলস্টেশনে দাঁড়িয়ে থাকা একটি মালবাহী ট্রেনকে পেছন থেকে ধাক্কা দিয়েছে চট্টগ্রাম থেকে ছেড়ে আসা যাত্রীবাহী ‘সোনার বাংলা এক্সপ্রেস’ ট্রেন। আজ রোববার সন্ধ্যা সাড়ে ছয়টার দিকে ঢাকা-চট্টগ্রাম রেলপথে এ দুর্ঘটনা ঘটে। এতে ‘সোনার বাংলা এক্সপ্রেস’ ট্রেনের ইঞ্জিনসহ পাঁচটি বগি লাইনচ্যুত হয়।

দুর্ঘটনায় অন্তত ৫০ জন আহত হয়েছেন। তাঁদের মধ্যে ছয়জনের অবস্থা গুরুতর বলে জানা গেছে। আহত ব্যক্তিদের উদ্ধার করে নাঙ্গলকোট উপজেলা স্বাস্থ্য কমপ্লেক্সসহ স্থানীয় বিভিন্ন হাসপাতালে ভর্তি করা হয়েছে। এ ঘটনার পর চট্টগ্রামের সঙ্গে সারা দেশের রেল যোগাযোগ বন্ধ হয়ে গেছে।

রেলওয়ের একাধিক কর্মকর্তা ও স্থানীয় সূত্রে জানা গেছে, নাঙ্গলকোট উপজেলার হাসানপুর রেলওয়ে স্টেশনে মালবাহী একটি ট্রেন দাঁড়ানো ছিল। মালবাহী ট্রেনের লাইনেই চট্টগ্রাম থেকে ছেড়ে আসা ঢাকাগামী ‘সোনার বাংলা এক্সপ্রেস’ ট্রেনটি ঢুকে পড়ে। এ সময় সোনার বাংলা ট্রেনটি মালবাহী ট্রেনটির পেছন থেকে ধাক্কা দেয়। এতে যাত্রীবাহী ট্রেনটির ইঞ্জিনসহ পাঁচটি বগি লাইনচ্যুত হয়ে রেললাইনের পাশে ছিটকে পড়ে।

নাম প্রকাশ না করার শর্তে রেলওয়ের এক কর্মচারী বলেন, রেলওয়ে স্টেশন থেকে সিগন্যাল ঠিক না করায় এ দুর্ঘটনা ঘটে। যে লাইনে মালগাড়িটি আছে, সেই লাইনে যাত্রীবাহী ট্রেন কীভাবে ঢোকে? স্টেশন কর্তৃপক্ষের অবহেলার কারণেই দুর্ঘটনা ঘটেছে।

নাঙ্গলকোট রেলওয়ে স্টেশনের মাস্টার মাহমুদুল হক দুর্ঘটনার বিষয়টি প্রথম আলোকে নিশ্চিত করেছেন। তবে তিনি তাৎক্ষণিকভাবে বিস্তারিত কিছু জানাননি। এ ঘটনার পর কুমিল্লা ও লাকসাম থেকে রেলওয়ের কর্মকর্তারা ঘটনাস্থলে পৌঁছেছেন। চট্টগ্রাম থেকে একটি দল ঘটনাস্থল পরিদর্শনে রওনা দিয়েছে।

নাঙ্গলকোট উপজেলা নির্বাহী কর্মকর্তা (ইউএনও) রায়হান মেহেবুব প্রথম আলোকে বলেন, ‘দুর্ঘটনার খবর পেয়ে রেলস্টেশনে এসেছি। দুর্ঘটনায় যাত্রীবাহী সোনার বাংলা ট্রেনের অর্ধশতাধিক যাত্রী আহত হয়েছেন। তাঁদের মধ্যে ঢালুয়ার একটি ফার্মেসিতে প্রায় ২০ জন যাত্রী প্রাথমিক চিকিৎসা নিয়েছেন। আহত অন্যদের উদ্ধার করে লাকসাম ও কুমিল্লার বিভিন্ন হাসপাতালে পাঠানো হচ্ছে। এখন পর্যন্ত নিহত হওয়ার কোনো খবর পাওয়া যায়নি।’'''

# @title
result = remove_stopwords(raw_text, stopwords)
mod_result = []
for i in result:
    if not i in punctuations:
        mod_result.append(i)

# @title

New_mod = ''
for i in range(len(mod_result)):
    New_mod += translate(mod_result[i], 'en', 'auto') + ' '

# @title
sia = SentimentIntensityAnalyzer()

# Bangla Text Input

# Performing sentiment analysis
scores = sia.polarity_scores(New_mod)

# Displaying sentiment scores
print(scores)
